{"Title": "Low Life", "Year": "2004", "Rated": "N/A", "Released": "21 May 2004", "Runtime": "105 min", "Genre": "Action, Crime, Drama", "Director": "Kwon-taek Im", "Writer": "Kwon-taek Im", "Actors": "Seung-woo Cho, Gyu-ri Kim, Hak-jun Kim, Ha-jun You", "Plot": "A Heroic, yet a tragic life of a fearless man begins! School days filled with fist fights It is at the end of President RHEE Seung-man's Liberal Party regime, and the streets are filled with demonstration parades. And there is Tae-woong in his disheveled school uniform, ignorant to all the chaos that surrounds him. The only concern on his mind is to find the bully from Hongik High who beat up his friend and to take his revenge upon him. He successfully finds the kid and beats him up pretty good. However, he gets stabbed by furious Seung-moon, who eyewitnesses the whole incident. With a bloody knife stuck in his body, Tae-woong shows up at Seung-moon's house and tells him to pull out the knife himself. Meanwhile, Seung-moon's older sister Hae-ok finds Tae-woong and his reckless behavior rather attractive. Later, when the police hears about this incident, they interrogate Tae-woong to investigate Seung-moon and Hae-ok's father PARK Il-won, who is a politician of the opposition party. However, Tae-woong keeps his mouth shut and protects Seung-moon's family. Entering the heart of Myungdong PARK Il-won runs for office as an independent candidate. However, his campaign rally soon falls into a complete chaos when Salmosa, a political gang under the Jaeryong Gang who are paid off by the Liberal Party, intrudes into the rally area. Infuriated Tae-woong quickly gains control over the situation. And soon after the incident, he starts to work for the Myungdong Gang as a bouncer at their best nightclub 'Miami'. Around the same time, Hae-ok is transferred to a nearby school as a teacher and the two start to get more drawn to each other. In the mean time, the war between the Myungdong Gang and its rival Jaeryong Gang is ever escalating and ultimately, the Myungdong Gang collapses by a conspiracy set up by the Liberal Party, who supports the Jaeryong Gang. Even in the midst of the bloody demonstration of the Student Revolution in April 1960, Tae-woong goes around collecting debts from former politicians to earn a living. And finally after series of defeats, PARK Il-won gets elected to the National Assembly. Happiness doesn't last forever... After promising her father that she'll turn Tae-woong into an honest living man, Hae-ok and Tae-woong are married with her father consent. The happy days continue with Hae-ok's pregnancy of their first child. Then, on the day of her delivery, as they are on their way to the hospital, they witness the tanks for the Coup d'Etat of May 1961 entering Seoul. And Tae-woong's life falls into the uncontrollable whirlpool of modern history.", "Language": "Korean", "Country": "South Korea", "Awards": "2 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BNjY5ODkzNTk4OV5BMl5BanBnXkFtZTgwNzQyMTQ2MzE@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.2", "imdbVotes": "233", "imdbID": "tt0403100", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}