{"Title": "Everlasting Regret", "Year": "2005", "Rated": "N/A", "Released": "29 Sep 2005", "Runtime": "115 min", "Genre": "Drama, Romance", "Director": "Stanley Kwan", "Writer": "Anyi Wang (novel), Elmond Yeung (screenplay)", "Actors": "Sammi Cheng, Tony Ka Fai Leung, Jun Hu, Daniel Wu", "Plot": "A person's life is destined to be shorter than that of a city. Having spent her whole life in Shanghai, Qiyao has her moments of prosperity and her fair share of loneliness. She finally fades and disappears but Shanghai remains a metropolitan city. Shanghai in the 1930s is glamorous and seductive. A pretty young girl from an ordinary family, Qiyao is lucky enough to win the 2nd runner-up of the \"Miss Shanghai\" contest. Mr. Cheng, her admirer as well as a photographer who assists her to her success, knows the girl is going to live an extraordinary life. It turns out she is going to witness the decades of changes to her city. 1948, Officer Li, an official in control of the army, keeps her as his lover. During the time, she spends her life at the Parliament ballroom, accompanies him through dangerous situations, and tries to devote all of herself to a man she believes she can spend the rest of her life with. But one day, he disappears and does not return. She never gets to find out the reason for his disappearance. This happens often in Shanghai at the time. In 1956, Qiyao begins to live a plain and simple life that is totally different from her glorious days. Nobody knows her past and she appears to be a young single woman. Her only friend is the married Mr. Cheng whom she keeps at a distance. But the calmness is broken when a rich young man Ming shows up. Qiyao is satisfied with Ming in every way except for his lack of courage as a man. When Qiyao finally makes a decision to marry him, Ming leaves her and goes to Hong Kong for his family business. Qiyao is alone again, but with an unborn child. She marries a sick and dying man, simply to find her child a father. Mr. Cheng is the only person who understands that she does it to regain her dignity. In 1970, grateful that the divorced Mr. Cheng has never stopped loving her, Qiyao tries to get closer to him and wants to marry him. Mr. Cheng, however, devotes himself to popular campaign that sends educated urban men to the countryside to help the rural population. He leaves for Yunnan, thinking that it will only be a year, but does not come back until ten years later. One day, Mr. Cheng returns, introducing to Qiyao a young man who is addicted to the lifestyle of old Shanghai. Regardless of the age difference, Qiyao and the young man fall in love with each other. Unfortunately, the young man secretly plans to go abroad, leaving Qiyao alone in Shanghai, just as what his predecessors have done. Qiyao finally breaks down as she realizes no one is as loyal as she is to the city where her life begins and will end.", "Language": "Mandarin", "Country": "Hong Kong, China", "Awards": "4 wins & 8 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BYTNiZGYwNmQtNzg2Yy00MDQ2LWFjZDYtM2EyYWE0YTBlYzE4XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "5.6", "imdbVotes": "380", "imdbID": "tt0475263", "Type": "movie", "DVD": "24 Nov 2009", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "5.6/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}