{"Title": "Inju: The Beast in the Shadow", "Year": "2008", "Rated": "N/A", "Released": "03 Sep 2008", "Runtime": "105 min", "Genre": "Mystery, Thriller", "Director": "Barbet Schroeder", "Writer": "Rampo Edogawa (novel), Jean-Armand Bougrelle (scenario), Frédérique Henri (scenario), Barbet Schroeder (scenario), Eitan Arrusi (collaboration), Franck Ribière", "Actors": "Benoît Magimel, Lika Minamoto, Shun Sugata, Maurice Bénichou", "Plot": "The writer and college professor, Alexandre Fayard, researches and gives lectures about the gruesome literary work of the mysterious Japanese writer Shundei Oe, considered by him to be the master of manipulation. In his underground detective novels, evil always prevails and Shundei Oe has never allowed anyone to see his face. His only image available is a frightening picture on the back of his best-sellers. Alex travels to Kyoto to promote his successful detective story that follows the same style of the Shundei Oe but with a positive message instead. He meets with his publisher, Ken Honda, from the publishing house Hakubunkan. While in an interview in a TV show, Alex receives a phone call from Shundei Oe that advises him to return to Paris, and Alex believes it is a marketing strategy of Ken. Then Alex and Ken go to a tea house where he meets the Masochist geisha Tamao, and Alex has a crush on her. Tamao discloses to Alex that she knows Shundei Oe and his real name is Hichiro Irata; further they were lovers when she rejected his proposal many years ago. From this moment on, Hichiro Irata loathed her and vanished. When she got pregnant by the wealthy and powerful business man Ryuji Mogi, Shundei Oe returned and stalked her. Alex decides to help Tamao and Ryuji Mogi against the menace of the deranged writer, and his mind is blurred between fiction and reality in dreadful nightmares.", "Language": "French, Japanese, English", "Country": "France, Japan", "Awards": "1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BMjM0Nzc3NjM5Ml5BMl5BanBnXkFtZTgwMzA4NTAzMTE@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "5.4", "imdbVotes": "814", "imdbID": "tt0818110", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "UGC International", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "5.4/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}