{"Title": "Mr. Nobody", "Year": "2009", "Rated": "R", "Released": "26 Sep 2013", "Runtime": "141 min", "Genre": "Drama, Fantasy, Romance, Sci-Fi", "Director": "Jaco Van Dormael", "Writer": "Jaco Van Dormael", "Actors": "Jared Leto, Sarah Polley, Diane Kruger, Linh Dan Pham", "Plot": "In the year 2092, one hundred eighteen year old Nemo is recounting his life story to a reporter. He is less than clear, often times thinking that he is only thirty-four years of age. But his story becomes more confusing after he does focus on the fact of his current real age. He tells of his life at three primary points in his life: at age nine (when his parents divorced), age sixteen and age thirty-four. The confusing aspect of the story is that he tells of alternate life paths, often changing course with the flick of a decision at each of those ages. One life path has him ultimately married to Elise, a depressed woman who never got over the unrequited love she had for a guy named Stefano when she was a teenager and who asked Nemo to swear that when she died he would sprinkle her ashes on Mars. A second life path has him married to Jean. Their life is one of luxury but one also of utter boredom. And a third life path has him in a torrid romance with his step-sister Anna, the two who, as adults, would search for each other after having been torn apart as teenagers. These life paths also intersect, with the three women sometimes entering the alternate life in some other aspect. Are any of these lives real or are they all a figment of his imagination?", "Language": "English, Mohawk", "Country": "Belgium, Germany, Canada, France, UK, Luxembourg", "Awards": "11 wins & 6 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMTg4ODkzMDQ3Nl5BMl5BanBnXkFtZTgwNTEwMTkxMDE@._V1_SX300.jpg", "Metascore": "63", "imdbRating": "7.8", "imdbVotes": "204,844", "imdbID": "tt0485947", "Type": "movie", "DVD": "25 Feb 2014", "BoxOffice": "$3,600", "Production": "Magnolia Pictures", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.8/10", "RottenTomatoesRating": "67%", "MetacriticRating": "63/100"}