{"Title": "Human Flow", "Year": "2017", "Rated": "PG-13", "Released": "20 Oct 2017", "Runtime": "140 min", "Genre": "Documentary", "Director": "Weiwei Ai", "Writer": "Chin-Chin Yap, Tim Finch, Boris Cheshirkov", "Actors": "Israa Abboud, Hiba Abed, Rami Abu Sondos, Weiwei Ai", "Plot": "Over 65 million people around the world have been forced from their homes to escape famine, climate change and war in the greatest human displacement since World War II. Human Flow, an epic film journey led by the internationally renowned artist Ai Weiwei, gives a powerful visual expression to this massive human migration. The documentary elucidates both the staggering scale of the refugee crisis and its profoundly personal human impact. Captured over the course of an eventful year in 23 countries, the film follows a chain of urgent human stories that stretches across the globe in countries including Afghanistan, Bangladesh, France, Greece, Germany, Iraq, Israel, Italy, Kenya, Mexico, and Turkey. Human Flow is a witness to its subjects and their desperate search for safety, shelter and justice: from teeming refugee camps to perilous ocean crossings to barbed-wire borders; from dislocation and disillusionment to courage, endurance and adaptation; from the haunting lure of lives left behind to the unknown potential of the future. Human Flow comes at a crucial time when tolerance, compassion and trust are needed more than ever. This visceral work of cinema is a testament to the unassailable human spirit and poses one of the questions that will define this century: Will our global society emerge from fear, isolation, and self-interest and choose a path of openness, freedom, and respect for humanity?", "Language": "English", "Country": "Germany, USA, China, Palestine, France", "Awards": "6 wins & 12 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMTU4ODI2NjIzNF5BMl5BanBnXkFtZTgwNDQwMzUyMzI@._V1_SX300.jpg", "Metascore": "77", "imdbRating": "7.0", "imdbVotes": "2,163", "imdbID": "tt6573444", "Type": "movie", "DVD": "16 Feb 2017", "BoxOffice": "$446,438", "Production": "Amazon Studios and Participant Media", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.0/10", "RottenTomatoesRating": "91%", "MetacriticRating": "77/100"}