{"Title": "Hobson's Choice", "Year": "1954", "Rated": "Not Rated", "Released": "19 Apr 1954", "Runtime": "108 min", "Genre": "Comedy, Drama, Romance", "Director": "David Lean", "Writer": "Harold Brighouse (by), David Lean (screenplay), Norman Spencer (screenplay), Wynyard Browne (screenplay)", "Actors": "Charles Laughton, John Mills, Brenda de Banzie, Daphne Anderson", "Plot": "1880s Salford, England. Widowed Henry Hobson, owner/operator of Hobson's Boots, lives with his three adult daughters, Maggie, Alice and Vicky, in a flat attached to the shop. Henry is miserly, dipsomaniacal and tyrannical, not allowing his daughters to date as their sole purpose in life is in service to him and to the shop, they who receive no wages in that professional service. He changes his mind about Alice and Vicky, for who he will choose husbands, despite they, the romantic ones, already having chosen the men they would marry if given the opportunity. He will, however, not provide them with a dowry, which may prove to be a challenge in finding them who he would consider suitable husbands. Concerning Maggie, he believes she is far too useful to him as the overly efficient and organized one to let go, and too old at age thirty for any man to want her anyway. Incensed by her father's attitude about her, Maggie decides that she has to show him how wrong he is about her being an unmarriable spinster. As such, she makes a proposal to timid Willy Mossop, the shop's poor, uneducated and illiterate boot hand but best boot maker - apparently better than any boot maker in nearby Manchester - he who has known no other professional life than the shop: they enter into a marriage of convenience. Despite the differences in their social classes, Maggie believes she can show her father that she can find a husband, while forcing him to treat Willy better, and by association her, by paying him decent wages or else she will use her wifely influence to convince Willy to take his and her valuable services elsewhere. If their hands are forced, Maggie believes their best weapon is wealthy and particular Mrs. Hepworth, who said she will have no one else but Willy make her boots. Maggie has even taken into consideration what effect her actions will have on her sisters' nuptials, she who vows to them that all will be all right in that regard. Although she truly has no idea how her father will react, she also may not have considered Willy, who may already have a life of his own outside the shop, and if he does agree what effect her plan will have on him and his entire being.", "Language": "English", "Country": "UK", "Awards": "Won 1 BAFTA Film Award. Another 1 win & 4 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMDQ1MDQ2NWYtYzVjMC00ZjBiLWEwYjktNzNkYmU3MjgyMzkzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.7", "imdbVotes": "6,100", "imdbID": "tt0047094", "Type": "movie", "DVD": "17 Feb 2009", "BoxOffice": "N/A", "Production": "Criterion Collection", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.7/10", "RottenTomatoesRating": "90%", "MetacriticRating": "N/A"}