{"Title": "My Love and I", "Year": "1964", "Rated": "N/A", "Released": "19 Dec 1964", "Runtime": "106 min", "Genre": "Drama, Thriller", "Director": "Gunnar Höglund", "Writer": "Bosse Gustafsson (novel), Bosse Gustafsson (screenplay), Gunnar Höglund", "Actors": "Mathias Henrikson, Maude Adelson, Lars Lind, Guy De La Berg", "Plot": "'The King's Mountain Path' is a long line for wandering, with unmanned sleeping accommodation cabins at appropriate distances. It is not without dangers, in particular when narrow and shallow but speedily running creeks must be crossed. - When they were teenagers, a boy and girl wandered along this path, and had a sexual relation. They decided to meet again after exactly ten years, and at exactly this path. Both kept the promise. The movie alternates between both time periods. At the second period the boy (or man) finds the girl's name in the cabin register, and notices that she is three days ahead of him. In a later cabin she is only two, and then only one day ahead. And then he finds her - drowned in a creek. In another scene he said that she was the only one he ever liked. Because of the shock he gets paranoid ideas. In the next cabin he finds another wanderer going in the opposite direction, and accuses him of having murdered the girl. Then he continues his way. But when climbing a mountain he lays down halfway up, seemingly without any intention to go further. The other wanderer realises that he is (momentarily) mentally ill, and tries to help him down. But he makes a vigorous pull in the rope, with the result that the other wanderer falls down and dies.", "Language": "Swedish", "Country": "Sweden", "Awards": "1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BYmJlMGYwNWMtZGE5My00ZTg0LWExZmYtM2Q4N2UwNjI1MDI4XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.2", "imdbVotes": "40", "imdbID": "tt0058278", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}