{"Title": "A Quiet Place in the Country", "Year": "1968", "Rated": "R", "Released": "14 Aug 1969", "Runtime": "106 min", "Genre": "Drama, Horror", "Director": "Elio Petri", "Writer": "Tonino Guerra (story), Elio Petri (story), Luciano Vincenzoni (screenplay and dialogue), Elio Petri (screenplay and dialogue)", "Actors": "Franco Nero, Vanessa Redgrave, Georges Géret, Gabriella Boccardo", "Plot": "Renowned painter Leonardo Ferri, whose works have a standard price set by the market, and his girlfriend Flavia live together in his studio in Milan. He has not completed any paintings in two months as he slowly goes mad. His mental issues, about which Flavia is aware, includes a recurring dream where she is torturing him before attempting to kill him. As such, Flavia makes arrangements for them to rent a country villa outside of Venice where the change in scenery may recharge his creative juices. Because she can feel negative energy toward her at the villa, Flavia decides to spend her weekdays in Milan, visiting on the weekends, leaving Leonardo alone at the villa during week with only the housekeeper, Egle. Still haunted by his mental problems, Leonardo tries but is unable to restart his work. During this time alone, he learns of Vanda Valier, a previous occupant of the villa who was killed outside the villa walls during the war at age fifteen. Many of the locals still have their own stories of Vanda, some who still seem obsessed with her and her timeless beauty. Leonardo becomes one of those obsessed. In his mental state, Leonardo will have to reconcile hie obsession with Vanda with his relationship with Flavia, especially as many believe Vanda's ghost still controls what happens at the villa.", "Language": "Italian, English", "Country": "Italy, France", "Awards": "3 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMzRhYzNlMzMtMDA0Ny00NTc5LWEyMmQtNmI1OWI2YmVjMGEzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.7", "imdbVotes": "1,079", "imdbID": "tt0065119", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "United Artists", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.7/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}