{"Title": "The Mass Is Ended", "Year": "1985", "Rated": "N/A", "Released": "15 Nov 1985", "Runtime": "94 min", "Genre": "Comedy, Drama", "Director": "Nanni Moretti", "Writer": "Nanni Moretti (story), Sandro Petraglia (story), Nanni Moretti (screenplay), Sandro Petraglia (screenplay)", "Actors": "Nanni Moretti, Ferruccio De Ceresa, Marco Messeri, Enrica Maria Modugno", "Plot": "Don Giulio, giovane prete romano, ritorna a casa dopo essere stato parroco in un'isola del Mar Tirreno ed è destinato ad una chiesa di periferia. A Roma egli ritrova i genitori, la sorella e i vecchi amici. Ma la realtà è diversa da quella che lui ha lasciato. La parrocchia è praticamente deserta : il suo predecessore si è sposato, ha un figlio e vive a pochi metri dalla canonica; ed anche gli amici sono cambiati (chi è sotto processo per terrorismo; chi vuol farsi sacerdote senza capire perchè; chi è omosessuale e sta vivendo squallide avventure; chi è stato abbandonato dall'amica e vive in un isolamento totale). Neppure in famiglia le cose vanno meglio. Il padre, ormai anziano, ha preso una sbandata per una donna e lascia la moglie, che si suicida. La sorella è incinta del fidanzato e don Giulio riesce a stento a non farla abortire. Coinvolto in tali gravi situazioni, scoraggiato, deluso e non sempre in grado di fornire una risposta ai dubbi che gli vengono esposti, a poco a poco don Giulio avverte l'insostenibile peso della propria amara solitudine. Non identificandosi più con quella città e con quegli ambienti, decide di accettare il posto di missionario in Sud America, dove potrà curare una comunità di persone, in fondo, realmente povere e smarrite. Una fuga liberatoria ? E' giusto \"scrollarsi i calzari\" quando intorno a te non vedi speranza ? Forse !", "Language": "Italian", "Country": "Italy", "Awards": "4 wins & 17 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BYzk2OTIzZTUtM2YyZC00NjNmLWE3ODItYmVlODFiNzgyN2U2XkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.3", "imdbVotes": "1,460", "imdbID": "tt0089584", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.3/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}