{"Title": "Monster", "Year": "2004–2010", "Rated": "TV-14", "Released": "06 Apr 2004", "Runtime": "24 min", "Genre": "Animation, Crime, Drama, Mystery, Thriller", "Director": "N/A", "Writer": "N/A", "Actors": "Hidenobu Kiuchi, Liam O'Brien, Mamiko Noto, Karen Strassman", "Plot": "Dr. Kenzo Tenma, a young but extremely talented neurosurgeon, lives his life working in a hospital in Germany. He is respected by his superiors for his incredible surgical skills, envied by his peers and he is engaged to the daughter of the hospital director. But one day his bright future changes when a little boy is brought in with a serious head injury, along with his twin sister, the aftermath of a family massacre. He is faced with a huge dilemma when his superior orders him to abort the boy's surgery and operate on the mayor instead, who was brought in much later. He decides that \"all life is equal\" and goes against his superiors to save the boy's life (who arrived first), which ultimately results in the mayor's death. The boy survives, leaving Tenma's career in ruins, his engagement to his fiancé broken. His downward spiral begins when one night, while he is out cold in a drunken stupor, the twins vanish from the hospital and Tenma's superiors - along with the hospital director - are found dead. Tenma, having no alibi and the only one with motive, is the prime murder suspect. He goes into hiding and vows to find the twins and prove his innocence. Little did he know, that this is only the beginning of a terrifying journey through countries, buried secrets and the dark depths of the human psyche...", "Language": "English, Japanese", "Country": "Japan", "Awards": "N/A", "Poster": "https://m.media-amazon.com/images/M/MV5BNDJhM2I1ZTgtNzUzNC00OTU3LWEzOWUtYzk3NjE0ZjkwOTVkXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "8.6", "imdbVotes": "17,357", "imdbID": "tt0434706", "Type": "series", "totalSeasons": "1", "Response": "True", "InternetMovieDatabaseRating": "8.6/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}