{"Title": "Julieta", "Year": "2016", "Rated": "R", "Released": "21 Dec 2016", "Runtime": "99 min", "Genre": "Drama, Mystery, Romance", "Director": "Pedro Almodóvar", "Writer": "Pedro Almodóvar, Alice Munro (basado en \"Destino\",  \"Pronto\" y \"Silencio\" de)", "Actors": "Emma Suárez, Adriana Ugarte, Daniel Grao, Inma Cuesta", "Plot": "Julieta (Emma Suarez) is a middle-aged woman living in Madrid with her boyfriend Lorenzo. Both are going to move to Portugal when she casually runs into Bea, former best friend of her daughter Antia, who reveals that this one is living in Switzerland married and with three children. With the heart broken after 12 years of total absence of her daughter, Julieta cancels the journey to Portugal and she moves to her former building, in the hope that Antia someday communicates with her sending a letter. Alone with her thoughts, Julieta starts to write her memories to confront the pain of the events happened when she was a teenager (Adriana Ugarte) and met Xoan, a Galician fisherman. Falling in love with him, Julieta divides her time between the family, the job and the education of Antia until a fatal accident changes their lives. Slowly decaying in a depression, Julieta is helped by Antia and Bea, but one day Antia goes missing suddenly after a vacation with no clues about where to find her, leaving Julieta desperate to understand the reasons of her missing...", "Language": "Spanish", "Country": "Spain", "Awards": "Nominated for 1 BAFTA Film Award. Another 13 wins & 61 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BZjI3ZTdmNjMtMTI5My00M2EyLTg5YmItMDAwODU4ZWYyYjFhXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SX300.jpg", "Metascore": "73", "imdbRating": "7.1", "imdbVotes": "26,557", "imdbID": "tt4326444", "Type": "movie", "DVD": "21 Mar 2017", "BoxOffice": "$1,489,848", "Production": "El Deseo", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.1/10", "RottenTomatoesRating": "84%", "MetacriticRating": "73/100"}