{"Title": "The Forgiveness of Blood", "Year": "2011", "Rated": "Not Rated", "Released": "17 Sep 2011", "Runtime": "109 min", "Genre": "Drama", "Director": "Joshua Marston", "Writer": "Joshua Marston, Andamion Murataj", "Actors": "Tristan Halilaj, Refet Abazi, Zana Hasaj, Erjon Mani", "Plot": "This film centers on a family in Albania, with main characters Rudina, the oldest daughter, and Nik, the oldest son. Both have a pretty normal life. Rudina is an A-student in high school hoping to continue on at university; Nik, very popular, is just falling in love with a classmate while dreaming of opening a business with a friend. Their father earns the family's income through a little bread delivery service, for which he shortcuts across his neighbours' ground. The neighbour resents this, even though the ground had actually once belonged to Rudina's and Nik's family. One day the conflict escalates and the neighbour gets killed by Rudina's and Nik's father and their uncle. Because the police only catch their uncle while their father successfully goes into hiding, the old law of blood feud is invoked against the family, whereby all males enter into virtual house arrest. Since only the women of the family can leave, Rudina has to quit school to continue her father's bread delivery service so the family can survive, leaving Nik at home to rot along with his dreams of starting an Internet café. The situation is tense as there seems to be no solution to the conflict.", "Language": "Albanian", "Country": "USA, Albania, Denmark, Italy, UK", "Awards": "4 wins & 6 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMTQxMDcxNjU5NV5BMl5BanBnXkFtZTcwNDI5MjgyNw@@._V1_SX300.jpg", "Metascore": "73", "imdbRating": "6.8", "imdbVotes": "1,735", "imdbID": "tt1787127", "Type": "movie", "DVD": "16 Oct 2012", "BoxOffice": "$119,683", "Production": "IFC Films", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.8/10", "RottenTomatoesRating": "84%", "MetacriticRating": "73/100"}