{"Title": "Gloria", "Year": "2013", "Rated": "R", "Released": "09 May 2013", "Runtime": "110 min", "Genre": "Comedy, Drama, Romance", "Director": "Sebastián Lelio", "Writer": "Sebastián Lelio (screenplay), Gonzalo Maza (screenplay)", "Actors": "Paulina García, Sergio Hernández, Diego Fontecilla, Fabiola Zamora", "Plot": "Divorced for more than ten years, Gloria, a vibrant 58-year-old office clerk in Santiago, Chile and mother of two grown-up kids, craves for adventure, while on the other hand, she refuses to spend the rest of her life in solitude and wail in self-pity. Instead, vivacious Gloria embraces her freedom, and because of her love for dance, she frequently hangs out at middle-aged singles' gatherings searching for love and intimacy, but most of all, achingly longing for connection and the long-lost companionship. But the funny thing about life is that it is utterly unpredictable, so when suddenly Gloria meets Rodolfo, a recently divorced former naval officer, she will decide to give love a second chance and daringly give it a shot. Regretfully, however, Rodolfo comes with baggage, as he is still attached to his former family and his two daughters, and even though Gloria is sincerely attracted to him, reality's harsh truth will inevitably bring her face-to-face with towering obstacles rather than undiluted excitement and ardent passion. In the end, Gloria alone, yet surrounded by people, sad but at the same time happy, will she find the strength to ultimately overcome them?", "Language": "Spanish, English", "Country": "Chile, Spain", "Awards": "19 wins & 15 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMzI1NjgxNDM3N15BMl5BanBnXkFtZTgwMTI4MDI1MDE@._V1_SX300.jpg", "Metascore": "83", "imdbRating": "6.8", "imdbVotes": "7,980", "imdbID": "tt2425486", "Type": "movie", "DVD": "28 Apr 2014", "BoxOffice": "$1,587,655", "Production": "Roadside Attractions", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.8/10", "RottenTomatoesRating": "99%", "MetacriticRating": "83/100"}