{"Title": "The Nun", "Year": "2013", "Rated": "Not Rated", "Released": "01 Jan 2015", "Runtime": "112 min", "Genre": "Drama", "Director": "Guillaume Nicloux", "Writer": "Denis Diderot (novel), Guillaume Nicloux (adaptation), Jérôme Beaujour (adaptation)", "Actors": "Pauline Etienne, Isabelle Huppert, Louise Bourgoin, Martina Gedeck", "Plot": "France, in the 1760s. Born to a bourgeois family, Suzanne (Pauline Etienne) is a beautiful young girl with a natural talent for music. Despite her faith, she is dismayed when her parents send her off to a convent, expecting her to become a nun. Suzanne first resists the rules of the convent, but soon finds out that she is an illegitimate child, leaving her no other option than to pronounce her vows and suffer the consequences of her mother's sin. She soon wants to escape the religious path and is trying to revoke her vows when the Mother Superior, who had brought her comfort and solace, dies. Her successor, Sister Christine (Louise Bourgoin), turns out to be a sadistic and cruel Mother Superior, inflicting the worst forms of humiliation upon Suzanne, such as depriving her of food and clothing. Suzanne is finally transferred to another convent, where she discovers another kind of Mother Superior (Isabelle Huppert), who develops an inappropriate affectionate bond with her... Adapted from Diderot's eponymous novel, The Nun tells the story of a woman trying to resist imposed religious values, revealing the dehumanizing effect of cloistered life.", "Language": "French, Latin", "Country": "France, Germany, Belgium", "Awards": "1 win & 4 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMTQ0NTU2OTI2OF5BMl5BanBnXkFtZTgwNjcyNTAxMzE@._V1_SX300.jpg", "Metascore": "51", "imdbRating": "6.5", "imdbVotes": "1,403", "imdbID": "tt2215221", "Type": "movie", "DVD": "05 May 2015", "BoxOffice": "N/A", "Production": "Les Films du Worso", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.5/10", "RottenTomatoesRating": "64%", "MetacriticRating": "51/100"}