{"Title": "The Stone Flower", "Year": "1946", "Rated": "N/A", "Released": "27 Dec 1946", "Runtime": "89 min", "Genre": "Adventure, Drama, Family", "Director": "Aleksandr Ptushko", "Writer": "Pavel Bazhov, Ivan Keller", "Actors": "Vladimir Druzhnikov, Yekaterina Derevshchikova, Tamara Makarova, Mikhail Troyanovskiy", "Plot": "Aging master gemcutter Prokopych is forced to take up a young apprentice against his will. He chooses young daredevil Danilo, who seems to have only one practical talent - the one for gemcutting. In time he becomes obsessed with his job and eventually outdoes even Prokopych. Prokopych's landlord orders the two to make him a stone casket so beautiful it will even impress a French marquess he made a bet with. Danilo gladly takes this challenge upon himself but Prokopych warns him that he mustn't let his craft consume him. Unfortunately, Danilo won't listen and after failing to make a stone casket so perfect that it seems like the stone had come to life, he abandons both his worried master and his lovely and loving fiancee Katya to travel to the legendary Copper Mountain where the most beautiful stone cup ever created is located. In fact, the cup is said to be so enchanting that no one wants to (or can) leave the mountain ever again after seeing it just once. Danilo plans to uncover its secret but instead falls pray to it magic as well. The Mistress of the Copper Mountain (aka Khozyayka Medhoy Gori) tales a liking to him and uses her sorcery to keep him by her side forever. Meanwhile, Prokopych agrees to train Katyenka as well and she agrees to look after him so they can help each other make their ends meet together. Will there be a happy ending for her and Danilo?", "Language": "French, Russian, Hungarian", "Country": "Soviet Union", "Awards": "2 wins & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BYTM0NTRhYWQtZTc0ZC00NWM2LThiNGQtZjY2ZGI5ZmRhZjVjXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.2", "imdbVotes": "314", "imdbID": "tt0038666", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}