{"Title": "Possessed", "Year": "1947", "Rated": "Approved", "Released": "26 Jul 1947", "Runtime": "108 min", "Genre": "Crime, Drama, Film-Noir, Thriller", "Director": "Curtis Bernhardt", "Writer": "Silvia Richards (screenplay), Ranald MacDougall (screenplay), Rita Weiman (story)", "Actors": "Joan Crawford, Van Heflin, Raymond Massey, Geraldine Brooks", "Plot": "A woman wanders the streets of Los Angeles in some sort of emotional distress. She is also under some delusion as she approaches many men, strangers who she calls \"David\". Eventually, an ambulance is called, the attendants who take her to the hospital, where she is eventually placed in the psychiatric ward. Placing her under some medication to help her remember, Dr. Harvey Willard, the psychiatrist on duty, is able to get some semblance of a story out of her over the ensuing days. This phase of her life begins just over a year ago when she, single RN Louise Howell, is under the employ of wealthy Dean Graham to take care of his chronically ill and largely bedridden wife, Pauline Graham, at their lake house outside of Washington, DC. Due to her circumstances, Pauline believes that Dean and Louise are carrying on an affair behind her back. Louise can see that Dean does have feelings for her that way in his loneliness. The \"David\" in question is David Sutton, a civil engineer who lives across the lake from the Grahams, he with who Louise had been having a secret relationship. That relationship was always meant to be casual, but David tries to break it off with her when he sees that she has fallen in love with him to an obsessional state. Louise begins to manipulate the situation to be in David's life, even if only peripherally. Louise also begins to feel that if she can't have David, nobody else should. Louise is eventually diagnosed with schizophrenia during this time - something she does not mention to anyone in her life - which places her story to Dr. Willard in some context, including what of the story is real and what is all part of her delusion.", "Language": "English", "Country": "USA", "Awards": "Nominated for 1 Oscar. Another 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BMTk0MTA0OTA5MF5BMl5BanBnXkFtZTgwMTg0NTgyMjE@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.2", "imdbVotes": "4,282", "imdbID": "tt0039725", "Type": "movie", "DVD": "14 Jun 2005", "BoxOffice": "N/A", "Production": "Warner Bros. Pictures", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.2/10", "RottenTomatoesRating": "89%", "MetacriticRating": "N/A"}