{"Title": "The Evil Forest", "Year": "1951", "Rated": "PASSED", "Released": "20 Jul 1955", "Runtime": "79 min", "Genre": "Drama, Fantasy, Romance", "Director": "Daniel Mangrané, Carlos Serrano de Osma", "Writer": "Daniel Mangrané (story), Carlos Serrano de Osma (adaptation), Francisco Naranjo (continuity), José Antonio Pérez Torreblanca (dialogue)", "Actors": "Gustavo Rojo, Ludmilla Tchérina, Félix de Pomés, Jesús Varela", "Plot": "To escape enemy bombing, two soldiers take refuge in a deserted church where they discover a manuscript dating back to the fifth century when barbarian hordes ravaged the Spanish countryside. It tells of two warriors, Roderico, who opposes war and useless bloodshed, who is slain by Klingsor, who takes over as the tribal chief. The dead man's widow flees to seek the Holy Mountain where the Knights of the Grail guard the Sacred Spear and the Holy Grail, but she fails to find it. She dies but her young son, Parsifal, survives and reaches maturity free from worldly temptations, evil and cruelty. He visits the Holy Mountain and meets Kundry, daughter of Klingsor, and they seemingly fall in love. She is ordered by her father to trap Parsifal, but she fails. Klingsor has the Holy Spear which discourages the Knight of the Grail. Parsifal pledges to get it back and Klingsor tries again to use his daughter to discourage him, but to no avail. He also tries to trap Parsival in the Evil Forest of the Seven Deadly Sins, but Parsival wins out and retrieves the Sacred Spear. He is permitted into the cave where the Holy Grail is kept. Kundry, too, is present, having cleansed herself of evil.", "Language": "Spanish", "Country": "Spain", "Awards": "1 win & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BZjZlNTM1NmItNjk2Yy00NWNkLWE4OGUtZGRiMmJkMTc5ZTg1XkEyXkFqcGdeQXVyMTk4MDgwNA@@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.2", "imdbVotes": "16", "imdbID": "tt0043903", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}