{"Title": "Biraj Bahu", "Year": "1954", "Rated": "N/A", "Released": "N/A", "Runtime": "145 min", "Genre": "N/A", "Director": "Bimal Roy", "Writer": "Saratchandra Chatterjee (novel), Nabendu Ghosh (adaptation), Nasir Hussain (dialogue), Bimal Roy (scenario)", "Actors": "Kamini Kaushal, Abhi Bhattacharya, Shakuntala, Pran", "Plot": "Nilambhar Chakravorty belongs to a poor family, and lives in a joint family with his married brother, Pitambar, unmarried sister, Punnu, and wife, Biraj. Since his sister is of marriageable age, he arranges her marriage, and borrows some money. When Pitambar comes to know about this, he refuses to share any expense in his sister's marriage, and decides to separate, resulting in a fence being put up between their homes. Nilambher, unable to find employment, is unable to pay back the loan, and soon both he and his wife barely have enough to live on. To complicate matters further, Deodhar, a wealthy young contractor has his eye on Biraj's beauty and would like to be intimate with her, in return for money and a better life. He even hires Biraj's maidservant, Sundari, to lure Biraj to him. One day when Nilambher goes to attend a funeral in a nearby town, and does not come home for two days. When he returns he is told that Biraj had been seen hear Deodhar's place. When he questions her, she refuses to explain and he asks to get out of his house, which she does, and eventually disappears from his life altogether. All Nilambher hears is rumors that Biraj has run away with Deodhar and is leading a comfortable life, but no one knows for sure where she is or why she refused to explain to Nilambher where she was that night.", "Language": "Hindi", "Country": "India", "Awards": "2 wins & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BNDFiNTk1ZTUtNDYwNy00NzRkLWIyYTQtZmNhMmU1YzNiZTcyXkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.1", "imdbVotes": "31", "imdbID": "tt0046780", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.1/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}