{"Title": "Heroes of Shipka", "Year": "1955", "Rated": "N/A", "Released": "07 Sep 1956", "Runtime": "90 min", "Genre": "Drama, History, War", "Director": "Sergey Vasilev", "Writer": "Arkadi Perventsev", "Actors": "Ivan Pereverzev, Viktor Avdyushko, Georgiy Yumatov, Konstantin Sorokin", "Plot": "The April Uprising of 1876 has been drowned in blood. Bulgarians cherish the hope that Russia will help them to win liberation from Ottoman bondage. In St. Petersburg a rally in support of the enslaved Slav nation is held. The possible repercussions, both at home and abroad, of war between Russia and Turkey are discussed at Tsar Alexander'court. The same issue is considered by the representatives of other Great Powers at Bismark's office. The Russo-Turkish War is declared. The Russian troops are on their way to Bulgaria.They cross the Danube. Near the town of Stara Zagora the Russian present the force of Bulgarian volunteers with a banner made in the town of Samara, Russia. At the Sultan's palace Lord Henry Eliot helps in decision-making at this time of crisis for the Empire. The battle for Stara Zagora. The population leaves the town. In the battle for Shipka pass the Bulgarian volunteers fight side by side with the Russian soldiers under the command of general Stoletov. The battle round the town of Pleven. The town is taken by Russians. After a council at the Russin HQ, where the two generals Totleben and Gurko insist on crossing the Balkan Range during the winter, the Russian troops set out through the mountain passes led by Bulgarian guides. Bulgarian and Russian fight courageously for the defense of Shipka. The road to Sofia is open. The welcoming of Russian troops outside Adrienopole. On the way to Constantinopole. The advance of the Russian army is halted by the Western Power'ultimatum to stop the war.", "Language": "Russian, Bulgarian", "Country": "Soviet Union, Bulgaria", "Awards": "1 win & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BMjI4NDQ1MTIxOV5BMl5BanBnXkFtZTgwNTc0MjE4NTE@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.1", "imdbVotes": "232", "imdbID": "tt0047021", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.1/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}