{"Title": "Valley of Peace", "Year": "1956", "Rated": "N/A", "Released": "04 Jun 1962", "Runtime": "82 min", "Genre": "Drama, War", "Director": "France Stiglic", "Writer": "France Jamnik, Vladimir Koch, Ivan Ribic, France Stiglic", "Actors": "John Kitzmiller, Evelyne Wohlfeiler, Tugo Stiglic, Boris Kralj", "Plot": "A boy (9 years?) and a rather younger girl lost their families in an air raid. They have heard about a valley where there is always peace and fancy that this is the house of the boy's uncle. They start wandering for the valley. At the same time an airplane is shot down and the black American pilot jumped by parachute. He finds the children at a ford. There is absolutely no danger. But the girl is standing in the middle of the river, scared and crying and neither daring to go forth or back. The pilot cannot abandon the children although they will reduce his chance of escaping. Both the Germans and the partisans know that the pilot had survived. Who will find him first? Several things happen in rapid succession. The children and the pilot find the uncle's house, which had since a long time been abandoned. The Germans arrive and catch the pilot. The partisans attack and liberate the pilot, who joins them. But during the fight he is soon deadly wounded and orders the children to run away. Then the house explodes. The children conclude that this was the wrong valley and decide to continue to search for the right and peaceful one.", "Language": "Slovenian, German, English", "Country": "Yugoslavia", "Awards": "1 win & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BZDcyODBhYzctZWJkMy00ODA1LWIxODctZGQ4ZWI4MmE2MTk3XkEyXkFqcGdeQXVyMTQ0MjgzODU@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.7", "imdbVotes": "227", "imdbID": "tt0049150", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.7/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}