{"Title": "Compulsion", "Year": "1959", "Rated": "Approved", "Released": "01 Apr 1959", "Runtime": "103 min", "Genre": "Biography, Crime, Drama, History, Thriller", "Director": "Richard Fleischer", "Writer": "Richard Murphy (screenplay), Meyer Levin (based on the novel by)", "Actors": "Orson Welles, Diane Varsi, Dean Stockwell, Bradford Dillman", "Plot": "In Chicago in 1924, Artie Strauss and Judd Steiner are friends and fellow law students who come from wealthy backgrounds. They have few true friends as they believe all their contemporaries to be intellectually inferior. Although Judd acts arrogantly towards others his inherent weakness is understood and exploited by Artie and indeed Judd appears to relish his submissiveness to Artie. Part of their goal in life, influenced perhaps by their admiration for Nietzsche, is to experience how it feels to do anything one pleases. They thus plot to commit what they consider the perfect crime - a kidnapping and murder - not only in order to experience killing for killing's sake, but also - especially in Artie's case - to taunt the authorities after the fact. They believe themselves above the law. The actual killing of little Paulie Kessler, and the subsequent attempts to cover their tracks, are not so perfect however. Sid Brooks, a fellow student (who also works for the Globe newspaper) whom they look down upon, is astute enough to deduce that a pair of glasses found with the body do not belong to the boy and the police begin to look for their real owner. Artie and Judd try to wriggle out of how this evidence may implicate them. However, the police manage to cleverly break down their defenses and they end up confessing. Jonathan Wilk, renowned for his ability to manipulate juries, is hired to defend the pair, despite his atheism being against the families' sensibilities. Jonathan has to decide how best to defend his clients in the face of the overwhelming evidence against them.", "Language": "English", "Country": "USA", "Awards": "Nominated for 1 BAFTA Film Award. Another 1 win & 5 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BOTgzOWY5YjYtMDJhNS00YTc4LTkxMzAtZjFjNTlkNWFjNzNiXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.4", "imdbVotes": "5,444", "imdbID": "tt0052700", "Type": "movie", "DVD": "23 May 2006", "BoxOffice": "N/A", "Production": "Fox", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.4/10", "RottenTomatoesRating": "100%", "MetacriticRating": "N/A"}