{"Title": "The Hawks and the Sparrows", "Year": "1966", "Rated": "Not Rated", "Released": "10 Dec 1969", "Runtime": "91 min", "Genre": "Comedy, Drama, Fantasy", "Director": "Pier Paolo Pasolini", "Writer": "Pier Paolo Pasolini (story), Pier Paolo Pasolini (screenplay), Dante Ferretti (screenplay)", "Actors": "Totò, Ninetto Davoli, Femi Benussi, Umberto Bevilacqua", "Plot": "This richly symbolic film is really impossible to understand without some knowledge of 20th Century Italian history, and particularly the power of the Roman Catholic Church. The Lateran Treaty of 1929 finally politically separated Italy from Church power by creating the Vatican as a sovereign state. But the trade off was the that the Church was still left in power over many aspects of everyday Italian life. For instance, Italy finally established a civilian divorce law through a bitterly contested 1970 referendum. Before then, divorce was under strictly in the domain of Church law, and the Church NEVER granted a divorce, even in extreme cases like when a spouse was abandoned many years hence. Overall, however, the power of the Church still resided in the blind allegiance of Italians at all levels to Church morality. Over decades, this led to impeding Italy's social and political progress, and greatly maintained the status quo in the division between the privileged upper class and the downtrodden masses. The Leftist and Communist movements that began after WWII battled against this status quo, and indirectly against the Church through Progressive agendas. ALL This doesn't even amount to an adequate thumbnail of all the issues that this film touched upon. Pasolini really needed to couch this head-on criticism of contemporary Italian society in a comedy, because I suspect that at some level he would have feared for his life had he delivered a more serious work covering the same controversial topics.", "Language": "Italian", "Country": "Italy", "Awards": "4 wins & 4 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BYmE1OTYwMmQtOTQxMi00MzViLWFkOTAtMTQ3ZjExZjFiMjY0XkEyXkFqcGdeQXVyMzQ5Njc3OTg@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.4", "imdbVotes": "3,767", "imdbID": "tt0061132", "Type": "movie", "DVD": "05 Apr 2005", "BoxOffice": "N/A", "Production": "Water Bearer Films Inc.", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.4/10", "RottenTomatoesRating": "77%", "MetacriticRating": "N/A"}