{"Title": "Victoria the Great", "Year": "1937", "Rated": "N/A", "Released": "28 Oct 1937", "Runtime": "112 min", "Genre": "Drama, History", "Director": "Herbert Wilcox", "Writer": "Miles Malleson, Charles de Grandcourt", "Actors": "Anna Neagle, Anton Walbrook, Walter Rilla, H.B. Warner", "Plot": "The story opens on the morning of 20 June 1837, when the Lord Chamberlain and Archbishop of Canterbury arrive to inform young Princess Victoria that her uncle, William IV, is dead, and that she is now queen. The new queen's mother and her adviser, Baron Stockmar, have been used to seeing their opinions prevail with Victoria, but now she is on the throne, she makes an effort to assert herself and show that she will not be a mere puppet. However, she agrees to confirm Prime Minister, Lord Melbourne in his place. Melbourne advises Victoria to marry, and suggests her German cousin, Prince Albert. The two appear incompatible but soon find that they are in love. As Prince Consort, Albert becomes frustrated that he is given no role in governing the country and by his powerless role as husband to the queen. Though Sir Robert Peel suggests that Victoria share some of the burdens of the crown with her husband, she refuses, on the grounds that the people would reject Albert as an interfering foreigner. Victoria's domination over her husband even includes her refusal to allow him to smoke his pipe, and this soon becomes a proxy battleground for their different perspectives. Victoria finally realises her error, and Albert becomes her trusted adviser, after he instinctively throws himself forward to protect her from an assassin's bullet. Victoria is then involved in a political crisis, as the Chartist movement gathers pace. Peel addresses the House of Commons, and as a result the Corn Laws, a tax on grain which was at the bottom of much of the popular discontent, are repealed. However, Albert is criticised following his appearance in the House of Commons. Albert's health is in decline, but he intervenes in another international crisis, preventing Lord Palmerston from sending an aggressive letter to Abraham Lincoln, who credits this with avoiding a war between the United States and Great Britain. After Albert's untimely death, and despite the protestations of her advisers and the ordinary people, Victoria disappears into a self-imposed purdah, until persuaded by Gladstone to return to an active public life. We leave her celebrating her Diamond Jubilee in 1897.", "Language": "English", "Country": "UK", "Awards": "2 wins & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BMjQ2MGZkMzUtNmIxOC00ZTJkLWI4YjEtMDc3Mzk4MTgzM2I0XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.5", "imdbVotes": "124", "imdbID": "tt0029734", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "Imperator Films", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.5/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}