{"Title": "An Eye for an Eye", "Year": "1957", "Rated": "N/A", "Released": "13 Sep 1957", "Runtime": "113 min", "Genre": "Drama", "Director": "André Cayatte", "Writer": "André Cayatte, Vahé Katcha (novel), Vahé Katcha (screenplay)", "Actors": "Curd Jürgens, Folco Lulli, Lea Padovani, Héléna Manson", "Plot": "In North Africa Dr. Walter (W) is a very skilled surgeon but lives at a distance from the hospital. In the evening a husband (H) and his sick wife come to his private home from far away. He tells them to go to the hospital. The wife dies during the operation. The other doctors think that W might have saved her. Shortly afterward a man asks W to come to a village to treat a very sick man. W goes thither in his car. The local habitants do not allow him to apply Western medical techniques, all tyres of his car are stolen, and he sees H in this village. W tells him that his wife would not have died if he had timely taken her to a doctor. W buys a lot of coca-cola and starts walking home on his feet. He refuses H's offer to show him a shortcut. But thrice he finds H sitting at the road much ahead of him. Then he accepts H's guidance = misguidance! When they have been without water for many days and W wishes he was dead, he wounds H with a knife. H is sure to die within 24 hours without medical treatment. Then H says that inhabited areas are found in a quite different direction. W starts in this direction, not followed by H. The camera rises and reveals that before W there is nothing but stone and sand.", "Language": "French, Arabic", "Country": "France, Italy", "Awards": "1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BYWNmODMzZDAtMWQyYy00OWE3LTlhOTItMzNjYWNmOWQ4NjhjXkEyXkFqcGdeQXVyNzMzMjU5NDY@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.2", "imdbVotes": "88", "imdbID": "tt0049569", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}