{"Title": "The Great War", "Year": "1959", "Rated": "Not Rated", "Released": "28 Oct 1959", "Runtime": "137 min", "Genre": "Comedy, Drama, War", "Director": "Mario Monicelli", "Writer": "Agenore Incrocci (story and screenplay), Furio Scarpelli (story and screenplay), Luciano Vincenzoni (story and screenplay), Mario Monicelli (story and screenplay), Agenore Incrocci (dialogue), Furio Scarpelli (dialogue)", "Actors": "Alberto Sordi, Vittorio Gassman, Bernard Blier, Folco Lulli", "Plot": "Italy, 1916. Oreste Jacovacci and Giovanni Busacca are conscripted, as all the Italian youths, to serve the army in the WWI. They meet at the recruiting office where Giovanni bribes Oreste in the hope of securing a medical deferment, however the joke is on him when Oreste pulls off a hilarious double cross. Destine to serve as comrades in the same unit, they meet again on the train to the front. Despite the rocky beginning and the stolen money, they become friends and the comedic duo experience everything from blustery sergeants to bureaucratic requisition officers to the war weary lieutenant Hen. While in the village of Tigliano they spend some months in relative peace, and Giovanni attempts to gain the graces (and favors) of overworked prostitute Costantina, who also turns the tables to lighten his wallet. But war also brings with it gruesome sights and harrowing dangers. During the most important battle among Italians and Austro-Hungarians, as the Italians in retreat, Giovanni and Oreste find themselves separated from their unit once again when the shells rain down, but this time \"gli due villiacchi\" will end up on the wrong side of the shifting front and fall into the hands of an Austrian officer. With their lives on the line, a slip of the tongue will force them to choose between their lives and their country. What should they do now?", "Language": "Italian, German", "Country": "Italy, France", "Awards": "Nominated for 1 Oscar. Another 6 wins & 8 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BZjRhNzEwMDgtNGQyZC00NWYxLTg2MzktNGVmNTMwNjk0ZWI5XkEyXkFqcGdeQXVyNjUyMTgxNjA@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "8.3", "imdbVotes": "3,406", "imdbID": "tt0052861", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "8.3/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}