{"Title": "Hotel Central", "Year": "1983", "Rated": "N/A", "Released": "07 Mar 1983", "Runtime": "105 min", "Genre": "Drama", "Director": "Veselin Branev", "Writer": "Veselin Branev", "Actors": "Iren Krivoshieva, Zhivko Garvanov, Valentin Gadzhokov, Boryana Puncheva", "Plot": "The film is based on the short stories of Bulgarian writer Konstantin Konstantinov (1890-1970). The action takes place against the background of the events of May 19, 1934 when after a coup d'état parliament was suspended, all political parties were dissolved and a German-style totalitarian regime was established in Bulgaria. In the new social atmosphere the dormant power ambitions of 'citizens of unblemished reputation and clean personal records' woke up. The action takes place in a small provincial town. The main character is a maid in a hotel 'Central Hotel'. She has been exiled here for leading an 'immoral life'. The owner often forces her to entertain important guests and she has no choice but to comply. Once, a company of actors arrives in the hotel. A pretty actress of a touring theater company is dreaming of getting to the top in the capital. Tinka, the chambermaid finds herself in the thick of the action. The girl watches the leading actress with awe. She does not need too long, however, to realize that the artistic world is full of hypocrisy. It gradually turns out, however, that corruption is not to be found where we would usually expect it to be. Tinka is dreaming of a normal human existence and personal happiness, but in such an absurd world this is an impossible dream. In spite of all her failures, she does not lose her faith in good. Made in the characteristic vintage style of the period, the film examines a futile personal attempt to adapt to a hostile social environment.", "Language": "Bulgarian", "Country": "Bulgaria", "Awards": "3 wins & 1 nomination.", "Poster": "https://m.media-amazon.com/images/M/MV5BYmQ3MWVjNmMtMzVhYS00YTBlLWIyZmUtMmYzZjZjMmMwM2MxXkEyXkFqcGdeQXVyMzg1OTY0NjI@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "7.2", "imdbVotes": "28", "imdbID": "tt0253134", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "7.2/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}