{"Title": "Twisted Obsession", "Year": "1989", "Rated": "R", "Released": "03 Aug 1990", "Runtime": "103 min", "Genre": "Drama, Mystery, Romance", "Director": "Fernando Trueba", "Writer": "Christopher Frank (novel), Manolo Matji (screenplay), Fernando Trueba (screenplay)", "Actors": "Jeff Goldblum, Miranda Richardson, Anémone, Daniel Ceccaldi", "Plot": "Dan Gillis, an American screenwriter living in Paris, recently abandoned by his wife, and getting used to his new life as a bachelor while trying to take care of his son, Danny - is commissioned to write a script for a movie called \"The Dream of the Mad Monkey\". The offer comes from Legrand, a successful producer with whom he has worked in the past, but on this occasion he is being asked to write an unconventional story with Malcolm, a young and unknown film director. Dan is undecided about the offer, seeing it as far from the kind of work he has grown used to, but eventually agrees to do the job despite the reticence of Marilyn, his beautiful disabled agent. As he starts to work on the script, Dan allows himself to become immersed in the closed universe of potentially incestuous relations surrounding Malcolm and his beautiful but emotionally detached young sister Jenny. Dan becomes obsessed with mysterious Jenny and they soon become lovers in a not so conventional way. In his obsession, Dan tries to find out more about her and in the process realizes that everything is not exactly what it seems and that he's been used.", "Language": "English, Spanish", "Country": "Spain, France", "Awards": "6 wins & 6 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BZjAwYmI5ZDItNjI5Yy00YjYwLWJmN2UtYzFmODE1Yjk4MGU2XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "5.8", "imdbVotes": "564", "imdbID": "tt0098407", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "N/A", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "5.8/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}