{"Title": "Scream of Stone", "Year": "1991", "Rated": "N/A", "Released": "03 Oct 1991", "Runtime": "105 min", "Genre": "Drama", "Director": "Werner Herzog", "Writer": "Hans-Ulrich Klenner, Walter Saxer, Robert Geoffrion (english dialogue), Reinhold Messner (original idea)", "Actors": "Vittorio Mezzogiorno, Stefan Glowacz, Mathilda May, Al Waxman", "Plot": "A meeting of two world famous climbers, one an experienced mountaineer (Roccia), the other a sport climber (Martin), results in a bet on which of the two is the best climber. Roccia states that Martin wouldn't survive on a 'real' climbing expedition, although he is the indoor 'world champion'. Then they both plan to climb the 'Cerro Torre' in the Patagonia region of South America, near the Argentinian/Chilean border, one of the world's most difficult mountains, especially considering the extreme weather conditions in the area. The journalist Ivan, using the rivalry for media exploitation, is joining them and reporting. The rivalry among the two men results eventually in the death of a common friend. Martin claims to have been at the top of 'Cerro Torre', but can't proof it. Then Martin 'steals' Roccia's girlfriend (Katrina), who feels lonely and under appreciated by Roccia. After some time the two men meet again at 'Cerro Torre' and the rivalry results in a 'climb against time' in which Martin and Roccia each attempt different routes up the mountain in a race to the summit. But they're in for a surprise...", "Language": "English, Spanish", "Country": "Germany, France, Canada, Italy, Argentina", "Awards": "3 wins & 2 nominations.", "Poster": "https://m.media-amazon.com/images/M/MV5BMjkwNDEyODY4OF5BMl5BanBnXkFtZTcwODQyNjUyMQ@@._V1_SX300.jpg", "Metascore": "N/A", "imdbRating": "6.3", "imdbVotes": "1,034", "imdbID": "tt0102855", "Type": "movie", "DVD": "N/A", "BoxOffice": "N/A", "Production": "Alliance", "Website": "N/A", "Response": "True", "InternetMovieDatabaseRating": "6.3/10", "RottenTomatoesRating": "N/A", "MetacriticRating": "N/A"}